docs/Примеры запросов/SendRequestRequestNoAttach.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1">
    <S:Body>
        <ns2:SendRequestRequest xmlns:ns3="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/faults/1.1"
                                xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"
                                xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
            <ns:SenderProvidedRequestData Id="SIGNED_BY_CONSUMER"
                                          xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"
                                          xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"
                                          xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
                <ns:MessageID>72db683d-c7e4-11e4-b8aa-d4c9eff07b77</ns:MessageID>
                <ns2:MessagePrimaryContent>
                    <ns1:BreachRequest xmlns:ns1="urn://x-artefacts-gibdd-gov-ru/breach/root-121294027/1.0.0"
                                       xmlns:ns2="urn://x-artefacts-gibdd-gov-ru/breach/commons-121294027/1.0.0"
                                       xmlns:ns3="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1"
                                       Id="PERSONAL_SIGNATURE">
                        <ns1:RequestedInformation>
                            <ns3:FamilyName>Петров</ns3:FamilyName>
                            <ns3:FirstName>Петр</ns3:FirstName>
                            <ns3:Patronymic>Петрович</ns3:Patronymic>
                            <ns2:RegPointNum>У160УК34</ns2:RegPointNum>
                        </ns1:RequestedInformation>
                        <ns1:Governance>
                            <ns2:Name>ГИБДД РФ</ns2:Name>
                            <ns2:Code>GIBDD</ns2:Code>
                            <ns2:OfficialPerson>
                                <ns3:FamilyName>Андреев</ns3:FamilyName>
                                <ns3:FirstName>Андрей</ns3:FirstName>
                                <ns3:Patronymic>Андреевич</ns3:Patronymic>
                            </ns2:OfficialPerson>
                        </ns1:Governance>
                    </ns1:BreachRequest>
                </ns2:MessagePrimaryContent>
            </ns:SenderProvidedRequestData>
            <ns2:CallerInformationSystemSignature>
                <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <ds:SignedInfo>
                        <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/>
                        <ds:Reference URI="#SIGNED_BY_CONSUMER">
                            <ds:Transforms>
                                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                                <ds:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"/>
                            </ds:Transforms>
                            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/>
                            <ds:DigestValue>gCgsBf0cKQagDkvOTPNZ9QDOca1eh47WY2pcPO7SanU=</ds:DigestValue>
                        </ds:Reference>
                    </ds:SignedInfo>
                    <ds:SignatureValue>
                        n3gLiv40sh2TpsBqMJP68/92K8t1OrbwUPC/2msfK7rerJ4NYGlo7wDVmfsOrx27oyzmYFfNaxyLxO+uANMYIA==
                    </ds:SignatureValue>
                    <ds:KeyInfo>
                        <ds:X509Data>
                            <ds:X509Certificate>
                                MIIBcDCCAR2gAwIBAgIENt5+9jAKBgYqhQMCAgMFADAtMRAwDgYDVQQLEwdTWVNURU0xMQwwCgYDVQQKEwNPVjIxCzAJBgNVBAYTAlJVMB4XDTE1MDIyNDA4MjgyNVoXDTE1MDUyNTA4MjgyNVowLTEQMA4GA1UECxMHU1lTVEVNMTEMMAoGA1UEChMDT1YyMQswCQYDVQQGEwJSVTBjMBwGBiqFAwICEzASBgcqhQMCAiMBBgcqhQMCAh4BA0MABEAFg3SFWWHiAcesibmzoeH/1zd2v0wIPMCbkpxldGPsGql86KOT4H4Bhes/e9iJwoQqM5HS4FfyflyYu2dAnW5xoyEwHzAdBgNVHQ4EFgQU2oIRiEorwbGixUA+40csmHLYV8swCgYGKoUDAgIDBQADQQCR/y4pFY/EgrXhubbW7auOFaBLc3W/rh/b0COjkPtPpMyN6BYMoMK5zAb3o1bmRCm0eNr4Az3OaN/sOdeI2vEr
                            </ds:X509Certificate>
                        </ds:X509Data>
                    </ds:KeyInfo>
                </ds:Signature>
            </ns2:CallerInformationSystemSignature>
        </ns2:SendRequestRequest>
    </S:Body>
</S:Envelope>